// Console.Clear();

// // Задача 1: Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).
// // int num1 = Convert.ToInt32(Console.ReadLine());

// // if (num1 == 1)
// // {
// //     Console.WriteLine("X = от 1 до ∞, Y = от 1 до ∞");
// // }
// // else if (num1 == 2)
// // {
// //     Console.WriteLine("X = от (-1) до (-∞), Y = от 1 до ∞");
// // }
// // else if (num1 == 3)
// // {
// //     Console.WriteLine("X = от (-1) до (-∞), Y = от (-1) до (-∞)");
// // }
// // else if (num1 == 4)
// // {
// //     Console.WriteLine("X = от 1 до ∞, Y = от (-1) до (-∞)");
// // }
// // else
// // {
// //     Console.WriteLine("Введите цифру от 1 до 4");
// // }

// // Задача 2: Напишите программу, которая принимает на вход число (N) и выдаёт таблицу квадратов чисел от 1 до N.
// // int n = Convert.ToInt32(Console.ReadLine());
// // for (int i = 1; i <= n; i++)
// // {
// //     int num1 = i * i;
// //     Console.Write($"{num1} ");
// // }

// // Задача 3: Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
// double x1 = Convert.ToDouble(Console.ReadLine());
// double y1 = Convert.ToDouble(Console.ReadLine());
// double x2 = Convert.ToDouble(Console.ReadLine());
// double y2 = Convert.ToDouble(Console.ReadLine());

// // Находим разницу в координатах
// double deltaX = x2 - x1;
// double deltaY = y2 - y1;

// // Находим квадрат расстояния по каждой оси
// double distanceSquared = deltaX * deltaX + deltaY * deltaY;

// // Извлекаем квадратный корень для получения фактического расстояния
// double distance = Math.Sqrt(distanceSquared);

// Console.WriteLine($"{distance}");

